<?php

return [
    'importers' => [
        'persons' => [
            'title' => 'الأشخاص',

            'validation' => [
                'errors' => [
                    'duplicate-email' => 'البريد الإلكتروني: \'%s\' تم العثور عليه أكثر من مرة في ملف الاستيراد.',
                    'duplicate-phone' => 'الهاتف: \'%s\' تم العثور عليه أكثر من مرة في ملف الاستيراد.',
                    'email-not-found' => 'البريد الإلكتروني: \'%s\' لم يتم العثور عليه في النظام.',
                ],
            ],
        ],

        'products' => [
            'title' => 'المنتجات',

            'validation' => [
                'errors' => [
                    'sku-not-found' => 'المنتج ذو الكود المحدد لم يتم العثور عليه.',
                ],
            ],
        ],

        'leads' => [
            'title' => 'العملاء المحتملون',

            'validation' => [
                'errors' => [
                    'id-not-found' => 'المعرف: \'%s\' غير موجود في النظام.',
                ],
            ],
        ],
    ],

    'validation' => [
        'errors' => [
            'column-empty-headers' => 'الأعمدة رقم "%s" تحتوي على رؤوس فارغة.',
            'column-name-invalid'  => 'أسماء الأعمدة غير صالحة: "%s".',
            'column-not-found'     => 'الأعمدة المطلوبة غير موجودة: %s.',
            'column-numbers'       => 'عدد الأعمدة لا يتوافق مع عدد الصفوف في الرأس.',
            'invalid-attribute'    => 'الرأس يحتوي على سمة غير صالحة: "%s".',
            'system'               => 'حدث خطأ غير متوقع في النظام.',
            'wrong-quotes'         => 'تم استخدام علامات الاقتباس الملتوية بدلاً من الاقتباسات المستقيمة.',
        ],
    ],
];
